tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# (Arguably) the best yacc variant
brew "byacc"
# Glorious Glasgow Haskell Compilation System
brew "ghc"
# Command-line interface for Cabal and Hackage
brew "cabal-install"
# Command-line interface for SQLite
brew "sqlite"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# Cross-platform make
brew "cmake"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Generate documentation for several programming languages
brew "doxygen"
# Command-line tool to interact with exercism.io
brew "exercism"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Fast Lexical Analyzer, generates Scanners (tokenizers)
brew "flex"
# Open-source alternative to the OpenGL Utility Toolkit (GLUT) library
brew "freeglut"
# Integer Set Library for the polyhedral model
brew "isl"
# GNU compiler collection
brew "gcc"
# GNU debugger
brew "gdb"
# Distributed revision control system
brew "git", link: false
# Git extension for versioning large files
brew "git-lfs"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Cross-platform program for developing Haskell projects
brew "haskell-stack", link: false
# Graphical front-end for GCC's coverage testing tool (gcov)
brew "lcov"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Keep your Mac's application settings in sync
brew "mackup"
# GUI for vim, made for macOS
brew "macvim"
# Modern and intuitive terminal-based text editor
brew "micro"
# Open source relational database management system
brew "mysql"
# Persistent key-value database, with built-in net interface
brew "redis"
# ISO/Edinburgh-style Prolog interpreter
brew "swi-prolog"
# JavaScript package manager
brew "yarn"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"

